// https://community.infinityward.com/eikmo72643/plugins/custom/activision/activisionpub/atvi_blogpostfeed?blog.id=infinityward&limit=100

[
  {
    "blog": "infinityward",
    "type": "message",
    "id": "10294198",
    "view_href": "/t5/Infinity-Ward-Blog/JUNE-2017-EMBLEM-EDITOR-ARTIST-PROFILE-MAGICSISTA24/ba-p/10294198",
    "subject": "JUNE 2017 EMBLEM EDITOR ARTIST PROFILE - MAGICSISTA24",
    "body": "Every community has individuals that consistently provide inspiration and groundbreaking ideas. Our June IW Emblem Artist of the Month is one of those people. She is one of the most prolific emblem artists, often revealing new works within hours. She is also known for her realism in portraits, as well as high impact cartoon subject matter. In Infinite Warfare, MagicSista discovered a way to create animated short films. She has a long history with artistry in emblems and a few tips for those that are new to emblem creation. How long have you been creating Emblems on Call of Duty? I have been making Emblems for 7 years. I was hooked when the feature was first implemented in Call of Duty: Black Ops, since then I’ve made emblems in every Call of Duty game that had an Emblem Editor. Do you have any hobbies outside of gaming? When I’m not gaming, or making emblems, I’m probably creating something with a different art medium. I also enjoy movies and the outdoors whenever I get a chance. Is there an Emblem you have made that you have found exceptionally challenging? Although the process of creating emblems has become easier with experience, each emblem has its unique challenges, and that’s one of the reasons I’m drawn to the Editor in the first place. My most difficult emblem in Infinite Warfare would have to be my dewdrop emblem, “Focus.” The main challenge was to create the first realistic emblem in Infinite Warfare. Aiming for realism with the Emblem Editor is always a challenge because it forces you to capture a high amount of detail while being limited to only 64 layers. Besides that, animating emblems has been a new refreshing challenge for me as well. Utilizing the “Group Layers” feature, I’m able to move select parts of an emblem and create animated shorts like these: https://twitter.com/MagicSista24/status/863482000757444609 https://twitter.com/MagicSista24/status/842990824648511489 How would you describe your Emblem Art Style? I usually focus on realistic and detailed representations of my subjects, however I do create abstracts and cartoony works also. Do you have any tips or tricks for making IW Emblems that would help someone just starting out? To me the most important tip is to be patient with yourself. Each emblem is its own puzzle that requires anywhere from 15 minutes to 5 hours to complete. Don’t give up if the emblems aren’t working out for you. If you truly want to make a good emblem, you will. What are your go–to Decals in the IW Emblem Editor? I usually use decals from the “Symbols” tab. You can’t go wrong with simple shapes such as circles or squares. Favorite Rig/Payload to run? FTL with FTL Jump. Favorite Game mode and Loadout to run on it? I love Free for All. My go-to Loadout for any game mode is the NV4 – Redemption with ELO, Quickdraw, Suppressor, 2 Cluster Grenades, Ghost, Hardline, and Hardwired. Keep up with MagicSista on Twitter, Facebook, YouTube, and Instagram!",
    "teaser": "Get to know MagicSista24 and her passion for emblem creation!",
    "conversation": {
      "type": "conversation",
      "featured": false
    },
    "tags": [],
    "labels": [],
    "post_time": "Jun 23, 2017 8:45:18 AM",
    "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/23/1/IW_EMBLEM_WEBSITEBANNER.png",
    "likes": "0",
    "author": "IW_Studio",
    "featured": "false",
    "views": "6829",
    "author": "IW_Studio",
    "externalFlag": "false"
  }, {
  "blog": "infinityward",
  "type": "message",
  "id": "10249329",
  "view_href": "/t5/Infinity-Ward-Blog/MAY-2017-Emblem-Editor-Artist-Profile-TheRealN97/ba-p/10249329",
  "subject": "MAY 2017 Emblem Editor Artist Profile - TheRealN97!",
  "body": "We continue to be amazed by the artists in our emblem community. One in particular stands out with his images that utilize the illusion of depth and focus to create hyper realistic emblems. TheRealN97 is the Infinity Ward May Artist of the Month! How long have you been creating Emblems on Call of Duty? I have been making emblems since Call of Duty Black Ops 1. The interest in making emblems really took off with Call of Duty Black Ops 3. I was inspired by one of my fellow creators, MagicSista24. I was very impressed by her work, and wanted to see if i could make emblems like that. I later got to meet a lot of other amazing creators, and they keep me going. Do you have any hobbies outside of gaming? Yes, I like drawing, working on motorcycles, cars, old tractors, and spend time on the road and in the gym working out. Is there an Emblem you have made that you have found exceptionally challenging? I found the bullet emblem to be very challenging. It required a lot of attention to detail, shading, getting the colors right.. It was very challenging to get that \"shiny gold like\" effect. How would you describe your Emblem Art Style? I would describe my emblem art style as realism. I prefer the more realistic approach in emblems, mostly close-up portrait emblems. I think realistic emblems are more impressive to look at, and I like the challenge in going for that realistic approach. Do you have any tips or tricks for making IW Emblems that would help someone just starting out? My tip to anyone wanting to make emblems would definitely be to go and watch emblem tutorials. I think it’s a good way to learn a lot of different techniques, like shading, perspective, and how the different shapes can be used. It is a lot of trial and error, but practice makes perfect, and I hope you have fun! What are your go – to Decals in the IW Emblem Editor? My go-to decals are the Rock Shadow, Circle, Merciless, Relentless & Ruthless. Favorite Rig/Payload to run? Warfighter with Claw. Favorite Game mode and Loadout to run on it? Domination. Loadout: Gun: Trencher Attachments: Foregrip, Extended mags & Stock. Perk 1: Ghost & Dexterity. Perk 2: Scavenger. Perk 3: Hardwired. Check out more emblems by TheRealN97 by following him on Twitter!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "May 16, 2017 9:39:10 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/22/1/IW_EMBLEM_BANNER.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "2466",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10232284",
  "view_href": "/t5/Infinity-Ward-Blog/April-2017-Emblem-Editor-Artist-Profile-Goodfellaemblems/ba-p/10232284",
  "subject": "April 2017 Emblem Editor Artist Profile - Goodfellaemblems!",
  "body": "The Emblem Editor in Infinite Warfare is a constant source of inspiration and awe for our creative community. This month we highlight one amazing artist that designs emblems with a unique shadow box feel. Goodfellaemblems is the IW April Artist of the Month! How long have you been creating Emblems on Call of Duty? I have been creating emblems since the release of ‘Call of Duty Black Ops 2’. I admired a fellow artist named ‘Dark Elfx’. I watched his Youtube channel and this inspired me to have a go at creating my own. I just played around at that stage and experimented with making images using various shapes. Do you have any hobbies outside of gaming? Yes, I have a Triumph Street Triple 675 Road Bike. I spend a lot of time out on the roads and maintaining it. I also like to do a bit of mountaineering. I like to keep fit. Is there a picture Emblem you have made that you have found exceptionally challenging? I found creating the solider from the mission ‘Wetwork’ most challenging. It was inspired by the image used by Call of Duty Modern Warfare. It required a lot of attention to detail and specific shading to make it look as accurate to the original image. It was challenging to create the composition with being limited to 64 Layers. How would you describe your Emblem Art Style? I would describe my art style to be mainly silhouette. I would create a scene represented as a solid shape of a single colour, usually black. I like using the various shapes to cut in and create the silhouettes. I always use this as my foundation which seems to differ from the other artists. I add the detailed layers later on as finishing touches, adding in more light or contrasting colours to bring the images to life. Do you have any tips or tricks for making IW Emblems that would help someone just starting out? I would recommend that anyone wanting to improve their technique should watch emblem artists YouTube channels. You can get a better insight into improving perspective and shading. You could try copying an emblem and experiment with shapes to see if you can master the technique. You should then pick an image you like and try and create an emblem of your own, adding your own twist or unique style so that you can stand out from the crowd. I mainly keep to a military style in my emblems and true to the Call of Duty theme. However, I like to challenge myself with something that is quite unique, anything from the Samurai to the Serengeti. Keep your options open when choosing your imagery and most of all have fun with it! What are your go-to Decals in the IW Emblem Editor? My go-to Decals are ‘The Merciless’, ‘Relentless’, ‘Ruthless’. I use these Decals to create skies, waters and landscapes. You may notice I use this often and it has become a pattern in my work. Favourite Rig/Payload to run? Rig: Phantom Payload: Pulsar Favourite Game mode and Loadout? Game mode: Hardcore TDM Loadout: NV4 - Fallout Elo Optic Quick draw & Extended Mags Tactical: Personal Radar Perk 1: Ghost & Dexterity Perk 2: Hardline Perk 3: Dead Silence I am a competitive player on Call of Duty IW. I use this set up to gain the best advantage over my enemy. Check out more emblems by Goodfellaemblems by checking him out on Twitter and Instagram!",
  "teaser": "Get to know our featured artist of the month!",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Apr 27, 2017 10:07:13 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/21/1/IW_EMBLEM_BANNER_april.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "10241",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10209081",
  "view_href": "/t5/Infinity-Ward-Blog/Community-Update-March-2017/ba-p/10209081",
  "subject": "Community Update - March 2017",
  "body": "Community Update – March 2017 Since our last update we’ve been working diligently on DLC, exciting new Quartermaster content, and various tweaks and in-game fixes for upcoming patches. First off, we’ll be rotating more featured game modes into Infinite Warfare, starting with a new Moshpit playlist that includes Search and Rescue and Reinforce beginning on March 31st. In Search and Rescue, you’ll take turns attacking and defending two bomb sites. You’ll only have one life and will drop your dog tag if you’re killed in action. If your tag is retrieved by a teammate, you’ll be revived and brought back into the fight. Picking up an enemy’s dog tag before their team does will eliminate them from that round. Detonate a bomb or kill all enemy players to win the round. Secondly, we’re excited to bring announcer packs to Infinite Warfare multiplayer. We’ll be kicking things off with two announcer packs: the UK Special Forces Voice Over Pack and the Method Man Voice Over Pack. We’re also happy to announce that the UK Special Forces VO Pack will be free to everyone, as a gift to our community. To select an Announcer Pack, follow the instructions below: Head to “Multiplayer” > “Store” > “VO Packs” to see the packs available. 1) Select \"Multiplayer\" from the main menu. 2) Select \"Public Match\" from the Multiplayer menu. 3) Select \"Barracks\" from the Public Match menu. 4) Once in the Barracks, select \"Announcer\" at the bottom (this will be located under “Clan Tag”) 5) In the Announcer Voice menu, select the desired Announcer Voice and press the corresponding \"Select\" button Earlier this month we released the emblem editor tool which gave our creative community a way to make their own personalized emblems in Infinite Warfare. We’re so impressed by the creativity and the skill behind the incredible designs we’ve seen and can’t wait to see more. Next month we’ll be starting our IW Emblem Artist of the Month blog on infinityward.com, so be sure to share your creations with us by using the hashtag #IWEmblems so we can share your work. Some eagle-eyed fans noticed that the Quartermaster is going to get a new feature added called “Ciphers.” Ciphers are ways for our robot friend to engage and interact with the community. We’ll have details about exactly what that means once this feature goes live. Lastly, we’re gearing up for DLC 2 with four new multiplayer maps and an all new zombies experience we can’t wait to share with you. Get ready for another wild trip into the twisted mind of Willard Wyler and some epic action on some of our freshest multiplayer maps ever. Again, thank you for your continued support and as always, and we’ll see you online!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Mar 28, 2017 11:14:19 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/20/1/INF_WAR_3.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "2377",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10181857",
  "view_href": "/t5/Infinity-Ward-Blog/Go-behind-the-scenes-with-the-IW-Vehicles-team/ba-p/10181857",
  "subject": "Go behind the scenes with the IW Vehicles team!",
  "body": "Learn what goes into making the vehicles of Infinite Warfare with Senior Designer Jolyon Myers, Lead Vehicle Artist Dan Savage, and your host Ashton Williams! Watch live video from Infinityward on www.twitch.tv",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Feb 22, 2017 10:39:02 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/19/1/Dropship_Destroyer1.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "1980",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10181782",
  "view_href": "/t5/Infinity-Ward-Blog/Community-Update-February-2017/ba-p/10181782",
  "subject": "Community Update - February 2017",
  "body": "We’ve been hard at work on a ton of great new content, DLC, fresh game features, and more, and wanted to provide an update about what’s on the horizon. First off, by the end of the month, we’re adding 360-degree rig rotation to all rig models in our menus so you can see what your rig customization looks like from all angles. Alongside this we’ll have an update to the Winner’s Circle in which your rigs will be carrying the last weapon you used in a match, your personal vanity weapon so to speak, for all your taunting impulses. Second, we’re going to be adding in new content on a regular basis to keep gameplay fresh. Be sure to visit the Quartermaster regularly to see what new items your robot friend has to offer. In our last community update, we mentioned that our emblem editor would be coming by the end of February. We need to extend our final testing by a few weeks, so we’re now aiming for release of the emblem by mid-March. We apologize for making our creative community wait a bit longer than planned to add their own unique emblem style to our game, but we’re confident it will be worth the wait. Ensuring that we’ve completed all QA, and added final polish, we look forward to sharing and talking about your amazing emblem creations once we launch it. Looking ahead, we will be adding a new mission team, with its own equipment and gear to chase, increasing prestige levels to grant a fresh challenge to our most skilled players, providing some new features for scorestreaks, the Quartermaster, and more such as a community poll giving you a say in picking the upcoming weeklong, featured game mode. As always, thank you for your support and reading until the end of this update. We hope you’re having a lot of fun with the game and all the new content as we strive to make our game better and better every day. See you online.",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Feb 22, 2017 7:15:58 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/18/1/IW_DIAG_2.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "4412",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10148078",
  "view_href": "/t5/Infinity-Ward-Blog/Miss-Our-Animation-Livestream-Check-out-the-VOD/ba-p/10148078",
  "subject": "Miss Our Animation Livestream? Check out the VOD!",
  "body": "The animation department talks all things Infinite Warfare and shares some behind the scenes footage including motion and performance capture, the creation of gestures and taunts, and more! Watch live video from on www.twitch.tv",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Jan 20, 2017 3:48:26 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/17/1/Untitled-10.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "1277",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10144928",
  "view_href": "/t5/Infinity-Ward-Blog/Community-Updates-January-2017/ba-p/10144928",
  "subject": "Community Updates - January 2017",
  "body": "It’s the beginning of a new year and we have plans to make 2017 as exciting as ever for Infinite Warfare and our fans. Since we launched the game, we’ve gathered a ton of feedback from the community. No matter the topic, it’s always productive. This discussion sustains us. It keeps us working hard as we strive to consistently raise the bar for our game development in ways that deliver a best-in-class military shooter. And to keep it up, we want to continue encouraging insightful, helpful conversation about the game we all love to play. So, with that in mind…here’s what we have to tell you today: Leaderboards, Combat Records and Emblem Editor. They’re being worked on and are going through waves (and waves) of testing at the moment. Please be patient with us and we’ll be sure to keep you updated as these features come online. Before the end of this month we’ll roll out Leaderboards, and by late February we’ll release Combat Records and the in-game editor that allows for custom emblem creation. We know everyone is anxious to get their hands on these features and we’re doing everything we can to finish testing, wrap them up and get them out to you. To provide some insight into the leaderboards, we’ve been designing a system that promotes the competitive spirit of our multiplayer. Our leaderboards will tell you what percentile you’re in overall and, if you’re in the top 10,000 overall, you’ll be able to see your specific rank in that list of 10,000. The idea behind this is that you have to earn your way onto the list of the top players in world. Even if you’re not a competitive player, you’ll know what percentile overall you reside in, as mentioned, but you’ll also be able to see how you stack up against friends in our weekly, monthly, and all-time friend leaderboards. Once the update is live your leaderboards will be populated after you play a match in that mode. So, don’t fret if you don’t see all your data straight away. We’ll be rolling out more details on the leaderboards once they are live. If there’s additional interest in other updates or general things, remember that we publish notes whenever there’s been a patch or update to the game that you can read on our website, InfinityWard.com or on Reddit. What else is happening at the studio this year? A Lot. We’re constantly working on new game modes, new ideas to keep things exciting, and increase support for all players, including the needs of CWL and esports players. Livestreams. We have a ton of talented developers who work here and our livestreams help us share the development process with you, introduce more members of the team, allow you to ask us questions directly, and offer behind the scenes access. The team is always eager for the chance to interact with you. Our livestreams will be a means of fostering further dialogue throughout the year. For our next stream, we’ll go behind the scenes with our animation department to discuss how they do what they do. After that, we’ll be speaking with the zombies team who is taking you back to the 1990s with our first Rave in the Redwoods livestream. We’ll discuss the design, the setting, and the horrors the cast of Willard Wyler’s next film will have to endure, so keep an eye on our social channels for timing and more information. Also, be sure to check out all our livestreams on our Twitch channel. Tactical TDM! We’ve received so much positive feedback about Tactical TDM, so… we’ll be leaving this mode in permanently! We’ll discuss what this means and how it will be playable as we roll out updates to our playlists. And, we know not everyone can play during the weekend, so we’ve decided to make all of our featured modes available for an entire week instead of just a weekend, so you’ll have ample time to complete those challenges and party up with your friends. Additionally, we’re looking at what other multiplayer modes might be fun to play with the characteristics of tactical added to them. We’ll update you on that further. Sabotage DLC. It’s our first DLC of the year and we couldn’t be more excited to bring you four new multiplayer maps and a new zombies experience. And it kicks off a full season of awesome new gameplay coming your way. A lot of the feedback and reactions we saw from the community from launch has helped shape these maps, so thank you for all the suggestions and comments you’ve posted to us over the past few months. You’re all an integral part of the process and we can’t wait for everyone to play. We’ll be sharing more about the upcoming DLC as we get closer to our January 31st release date but until then, feel free to check out CallofDuty.com for the latest. You’re playing, we’re listening…(and playing alongside you too) Maintaining and constantly improving the game is our top priority. We always have a plan of action for updates and patches, but in some cases require more testing time that can pump the brake, sometimes soft, sometimes hard, on the exact expected timing. This is especially true for things you may encounter in game, which is where your detailed feedback is invaluable to us. Things that require code changes, like map exploits for example, can take a bit longer and require more investigating while smaller patches can usually be created and deployed fairly quickly. Acknowledging unexpected issues that pop up is an important to us, and we always need as much information as possible to create the fix. Until we have that particular solution tested and working, it’d be unfair for us to tell you specifics about the fix, but rest assured that the team is cranking away. Are you working with Pro Players? Yes. We’ve been working with various players since before the game was released. The pro community is a unique subset of the Call of Duty community. They bring a particular perspective to our game and to the competitive scene. From year to year, these players work together to find the perfect team, learn a new game, and adjust to playing in a different in-game setting, so gathering their feedback is crucial when it comes to development and creating the best experience for them as they head into a new CWL season. One of the biggest features we removed due to pro feedback was the weapon draft that was mentioned in an early version of the rules for competitive Infinite Warfare. After many conversations, we decided to remove it from the upcoming season and focus our attention on other aspects of the competitive scope. For example, we’ve altered hybrid weapons, moved bomb sites, tuned various weapons, adjusted Payloads, and fixed bugs as we saw them. Are there more changes coming? Yes, and we’re working closely with folks at the CWL to help ensure these changes don’t overlap or happen right before major events. How can you continue to help? Please keep giving us your feedback. There are many ways to reach us be it Twitch, Twitter, Reddit, Facebook, or via customer support. We pore over player data, feedback, and suggestions with as many players as possible. Every player is an important part of the community. We want to know when you’re experiencing an issue or run into something we’ve never seen before, but we always need specific information to make a call on any possible solutions we can create. To help, tell us as much detail as possible. This should include how often you encounter a problem, what platform you’re playing on, the mode you’re playing, and if you can reproduce it. Video and screenshots are extremely helpful in these scenarios too. As always, we’d ask that folks stay productive and minimize threatening or demeaning language. Conversations about robots, however, are always welcome. You banned players for taking part in the holiday key exploit? Yes. Players who received a notification on their console were given a 48-hour ban along with a clean swipe of their keys and salvage. Ranks and inventory were not reset. Based on our ongoing review, additional penalties may be assessed in the coming weeks. If you’d like to freshen up on the current Enforcement policy, you can read it here. It has been updated to reflect the specifics of our game, but the policies in place remain much the same from its initial version. What about cheaters on PC? We know it can be incredibly frustrating to run into others who you feel might be cheating, so with the recent update we’ve added some additional security measures to help prevent others from creating an unpleasant experience. We take cheating very seriously and we’re continuously investigating any and all reports we see. Lastly, a big thank you! We love our community. Having the many opportunities to play and talk with all of you is something we are eternally grateful for and don’t take for granted. We think of the community as part of our team and appreciate all of the support you’ve continued to give to us. There’s an exciting year ahead and we’re looking forward to having more conversations with you along the way. See you online!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Jan 17, 2017 1:19:13 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/16/1/IW_DIAG_2.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "24715",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10111687",
  "view_href": "/t5/Infinity-Ward-Blog/Happy-Holidays-from-Infinity-Ward/ba-p/10111687",
  "subject": "Happy Holidays from Infinity Ward",
  "body": "We hope you’re enjoying a safe, fun holiday season this year. Be sure not to miss the final days of our 12 Days of Winter in-game gifting. We have plenty of surprises and delights left! Throughout the course of 2016 we’ve been working on all of our studio social media images and graphic design studio brand elements with the talented graphic designer Cory Schmitz. He’s created every holiday post image you saw this year. Cory even helped us refine and re-design our studio logo that we unveiled back in May. For the holidays, we enlisted his help and the illustration assistance of the ultra-gifted artist Lily N. to create this image:Pretty cool, right? There are some subtle hints to some of our community conversations in there and, of course, the beloved Ethan is the star of the art. We have so much more great Infinite Warfare content in the New Year that we’re excited to share with you. We’ll have more details and specifics over the coming weeks. For now, let’s gear up and evil. After all, the holidays are nearly over but there’s plenty of unfettered holiday playing hours of Call of Duty left. So, here’s to kicking off a great 2017! See you online!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Dec 28, 2016 10:59:38 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/12/1/Untitled-3.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "2437",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10111020",
  "view_href": "/t5/Infinity-Ward-Blog/New-playlist-bringing-back-traditional-gameplay-coming-this/ba-p/10111020",
  "subject": "New playlist bringing back traditional gameplay coming this Friday. Get ready for Tactical Team Deathmatch!",
  "body": "We’re always looking at how we can add new content and ways to play, so this Friday we’re introducing a new playlist that’s a bit of a throwback. Tactical Team Deathmatch brings a more classic style of gameplay to Infinite Warfare multiplayer by making some key changes to the movement and combat. We took a look at player movement and thought of some ways to make the gameplay more tactical. In this new mode boost jumping has been removed to keep combat grounded. Player movement speeds with weapons vary significantly to add more contrast to each weapon class. However, we’ve kept wall running to allow access to key areas in the maps. Weapon damage has also been rebalanced to better fit the playlist. Most notably head shot damage has been increased to add a more advanced level of engagements. This game mode provides a slower, more strategic gameplay experience. It’ll go live this Friday until 10am PST Monday, December 19. We’re excited to hear your thoughts on this as soon as you can play it. See you online!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Dec 14, 2016 11:21:22 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/11/1/Tactical-TDM_1200x676.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "2737",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10104548",
  "view_href": "/t5/Infinity-Ward-Blog/Help-Support-Veterans-during-our-Courage-Livestream/ba-p/10104548",
  "subject": "Help Support Veterans during our Courage Livestream!",
  "body": "We’re excited to announce our Courage livestream on Friday, December 9th from Noon till 8PM PST to help support Call of Duty Endowment, an organization that helps veterans of the armed services find jobs. Less than $600 dollars can help get a veteran a high quality job and with over 25,000+ veterans placed in jobs since 2009, your support can help them find even more! We hope you’ll join us as we’ll be playing Infinite Warfare with special guests, live on our Twitch channel: https://www.twitch.tv/infinityward You can also show your support in Call of Duty: Infinite Warfare with the Call of Duty Endowment Courage Pack! The pack comes with a Weapon Camo, Emblem, Calling Card, Reticle, and Weapon Accessory with 100% of the proceeds going directly to helping veterans. You can get the pack now on PlayStation 4.",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Dec 8, 2016 8:47:42 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/10/2/ebanner.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "1705",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10085763",
  "view_href": "/t5/Infinity-Ward-Blog/Meet-the-new-Infinity-Ward/ba-p/10085763",
  "subject": "Meet the new Infinity Ward",
  "body": "Infinity Ward is the original studio behind the Call of Duty franchise. That heritage means a great deal to us. This year we’re working on the next iteration of the critically-acclaimed and globally successful Call of Duty series. We have fresh and familiar faces, talented people striving to make the greatest video games possible. Meet the new Infinity Ward.",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Nov 18, 2016 2:51:12 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/7/1/Untitled-4.png",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "13720",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10085730",
  "view_href": "/t5/Infinity-Ward-Blog/Double-XP-and-Double-Weapon-XP-Weekend-Live-Now/ba-p/10085730",
  "subject": "Double XP and Double Weapon XP Weekend Live Now!",
  "body": "Weekend plans? Grab Double XP and Double Weapon XP to ramp up your player and weapon progression. It’s live now until Monday, November 21st at 10AM PST!",
  "teaser": "Rank up during Double-Double XP!",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Nov 18, 2016 2:21:00 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/6/1/IW_22XP_1200x676.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "1538",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10085719",
  "view_href": "/t5/Infinity-Ward-Blog/Updates-and-Patch-Notes/ba-p/10085719",
  "subject": "Updates and Patch Notes!",
  "body": "Want to know what that latest update was? Check here for all of our up to date patch notes! 6/28/17 General Fixes • Fixed an issue with the sniper mode of the Proteus having Target Assist enabled • Fix for an issue where the Black Sky Rig camo would unlock at the same time as Solar without having completed the Black Sky challenge 6/27/17 Featured Content and What’s New Days of Summer Event! • Log on Monday for a Free Supply Drop and every Wednesday and Friday for a free item from the Days of Summer collection! Plus, keep an eye out for new Days of Summer items in the Summer Hack each week! • Bounties in Zombies! • Grandma Knows Best Announce Pack • 2XP, 2WXP, 2XMTXP, 2X Keys until 7/5! • Turista 24/7 Playlist (TDM, Dom, KC) • Turista free to everyone across all playlists! Hero Rigs • Warfighter – Omar • Merc – Reyes • Synaptic – Ethan • FTL – Salter • Stryker – Price • Phantom - Ghost Weapons • 2187 (lever-action shotgun) • Trek-50 (single fire ballistic rifle) • Proteus (sniper/shotgun combo) Cosmetics • Gold, Diamond, Solar, Black Sky (non-loot) Progression Body and Heads for All Rigs General Fixes • Fix for a bug where the R-C8 may use an incorrect primary weapon while the player has an empty P-LAW equipped • ’Recently Collected’ added to the QM screen displaying recent items • Fix for the progress bar not appearing for some Soul Challenges in zombies • Fix for a bug where a player using the Cold Blooded perk would see allied Wardens highlighted red when looking through a thermal scope, using the T.H.O.R.’s thermal vision, or using the • Synaptic’s Reaper mode • Increased strength of emissive camos (including Black Sky) • Fix for weapon challenges not showing any progress for weapons unlocked via challenges while in splitscreen 6/16/17 General Fixes • Uplink – Fixed an issue where a player could remotely pick up the drone, if they killed the carrier while standing at the position of a caught pass. • Propulsion Trait adjustment: Recharge rate of boost meter has been slowed down • CWL Only: Removes Payload gains if you’re the last player alive and you defuse the bomb • CWL Only: Removed emergency spawn functionality in Uplink and Hardpoint. This would allow a player to spawn on a teammate’s position under very specific conditions where all other spawns were considered extremely poor. (For example: on top of trains mid-map on Throwback in Uplink) 6/8/17 Playlist Update General Fixes • Removed Hyper TDM and replaced with Cranked • Competitive playlist now adheres to competitive ruleset 6/8/17 General Fixes • Various map fixes • Fix a bug for the X-Eon’s vertical kick • Fixed an animation issue where rapidly moving between prone and crouch stance wasn’t updating the character model state at the correct rate (snaking) • CWL Only: Planting and defusing bombs will no longer add to your Payload meter. These actions will still give Scorestreak points • Prep for this weekend’s featured mode 6/1/17 General Fixes • Fix for an audio issue where the pass intercepted dialogue would play for the wrong team in Uplink and Defender modes • Fix for a bug where players could not call in their AP-3X if they had previously called it in and immediately jumped afterwards • Fixed the jump spread on the Auger – Fury when Laser Sight is equipped • Fix for some weapons not tracking in the Records section of the Barracks in Zombies • Prep for upcoming weekly featured mode 5/26/17 General Fixes • T. H.O.R.: Thunderclap adjustments: Narrowed the area at which each missile can automatically acquire a target. The target will need to be within the reticle for the missile to automatically seek the enemy out. • Added counters to scorestreaks that fire tracking missiles. If the player is in Phase Shift, using Active Camo, or has Hardwired, these missiles will not track them. This pertains to all versions of the Trinity Rocket (except Warhead variant), AP-3X: Lockdown, T.H.O.R.: Thunderclap, and Shock Sentry: Catacomb missiles. • Weapon Updates: Auger – Fury: Spread now becomes increasingly tighter the longer you fire Volk – Side to side recoil has been toned down slightly RVN – Ranges have been slightly reduced, but fire time between bullets has been reduced as well VPR – brought the shortest damage range in slightly Trencher – Bumped some aim down sight sway values back towards SMG characteristics. Still should feel closer to ARs in this regard however Titan – Adjusted the FOV on the Epic Scout’s default sight to provide a larger view and enhanced default zoom HVR Gemini –Hip fire accuracy improved slightly • Various map fixes • Prep for upcoming weekly featured mode 5/23/17 Featured Content and What’s New • Ken Jeong Voice Over Pack • CWL Personalization Pack - COD Champs General Fixes • Updated the Blind Eye perk challenge from “scorestreaks” to “weapon systems” as we have now made this challenge possible by killing micro turrets • Gestures – all cosmetic gestures can now be performed while sprinting • Adjusted the Blackout Grenade to bring its power level and overall consistency closer to that of the Jammer Grenade • Gameplay audio for Defender and Uplink will occur in the Winner’s Circle, interrupting the Announcer’s End Game win/loss VO lines. This has been fixed • Fix for the Calling Card notification not disappearing after highlighting or equipping the GameBattles calling card • In splitscreen, captured Hardpoint colors would not show different colors with players on different teams. This has been fixed • After entering a prestige, the After Action Report for completing a match would display placeholder images and text for calling cards. This has been fixed • Fix for an error that could occur when a guest player attempts to open the Friend list in the menu during gameplay on Xbox One • Fix for players being stuck on the “Purchasing Supply Drop” screen if they repurchase another drop while the loot ceremony screen is running in the background • Fixes for a few mouse and keyboard issues when accessing the Scorestreak Variants on PC • Fix for some calling cards not being displayed in the preview pane on the right • Fix for the VO line “Last Alive” not playing for the second team with one player left in SnR and SnD modes • Fix for users unable to use the “Change-Up” passive for the legendary T.H.O.R. – Nimbus when using button layouts that use the “toggle aim down sight” setting CWL/CODCaster • Fix for the CODCaster not displaying the proper team color on the objective icons 5/19/17 General Fixes • Adjusted the R-C8 – Meteor variant no longer deals mid-air fall damage (aside from the initial drop) when boosting in the air. Also fixed a bug where ground pounds for the Meteor were not always successfully activating • Fixed an issue that caused the Trinity Rocket side missiles to move too slowly • Various map fixes • Drone Package – Fuse: We now remove any disowned crates when the owner disconnects from the match. Also reduced the lifetime of the crate to 60 seconds • Uplink: Throwback – Added collision to bounce the drone back instead of resetting in 15 potential spots around the Press Box (areas where the player would be unable to reach the drone) • Adjusted the Synaptic sprint out fire times for the LMGs and Snipers to be in line with all other Rigs (time it takes to shoot the weapon when the fire button is pressed while sprinting) • Fix for an issue where assist scores would not add to scorestreak progress for the last kill in round based modes 5/16/17 General Fixes • Fix for a bug with the R-C8 that could possibly be exploitable • A few backend fixes 5/11/17 General Fixes • Fix for the final killcam banner at the bottom of the screen not properly displaying the name, color, and passive ability if a Scorestreak variant was used • Drone Package – Fuse: Increase in the earn cost required to unlock from 350 to 400 • Fix for Auger camo challenges not unlocking when completed • Various backend fixes and prep for upcoming in-game events 5/5/17 General Fixes • Fixed an issue in Infected Custom Matches where selecting ‘none’ for the primary and secondary weapon would result in no weapon (we now spawn you with fists) • CWL: Shockwave trait for the Merc rig is now restricted • After completing a FFA match in split screen, the announcer audio would overlap. This has been fixed • Custom Match: CTF: Using FTL Jump while on a magnet in Scrap, the flag may become stuck on top of the magnet and cannot be retrieved until the flag resets. This has been fixed • Updated the scorestreak variant menus to display proper unlock methods (these are not unlockable via supply drops, only crafting in the scorestreak prototype lab) • Various backend fixes 5/2/17 - Update Featured Content and What’s New • Ozzy Man Reviews Voice Over Pack • Scorestreak Variants Customize your loadout in new ways with scorestreak variants, now live in Infinite Warfare. Only obtainable through crafting, these new variants take your current playstyle to an all new level with Rare, Legendary, and Epic versions of your existing scorestreaks. You’ll want to be strategic though, as every streak has a strength and weakness. You can access these via the Scorestreak Lab in the Armory portion of the Quartermaster. General Fixes • Increasing the audio range of the Micro Turret and Shock Sentry • Rig ability Killjoys now allow both ability Payloads to count towards progress • Updated Trinity Rocket to prevent the lock-on missiles from aggressively tracking targets when they should have hit the ground • Infected: Removed secondary knife from R3K and FHR loadouts as your melee is always an OHK OSA replaces the M1 and Hailstorm loadout OSA can now be selected in custom matches • Assists score is now doubled if the player did a majority of the damage to the victim • Uplink: Improved passing behavior for the drone Fixed an issue where throwing the drone at a scorestreak would apply 1 damage • Fix for some players being unable to perform Taunts in the Winner’s Circle in both Public and Custom matches • Fix for some players being unable to equip a custom emblem after switching from a previously made emblem • Fix for some players encountering an issue where renaming an emblem could possibly delete it • Fix for animated weapon camos • Various map fixes CODCaster/CWL • Fix for the player arrows on the minimap only displaying the direction of the spectated player • Adjusted the team colors to be a bit more visible on the minimap • Added a ‘Contested’ icon when a defending and attacking both jump into the goal to better message when carry scores are blocked Shaolin Shuffle • Removed the Heart cooldown • Miscellaneous bug fixes 4/28/17 Playlist update: • Removed Grind and replaced with Mayhem • Tactical TDM playlist is now Tactical Moshpit. This includes TDM, Domination, and Kill Confirmed 4/27/17 General Fixes • Fix for a bug that prevented slide kills with SMGs from registering towards challenges properly • VPR changes: Slight increase to recoil Slight range adjustments Adjusted reload times Fixed oversight on clip size versus shots available; VPR fires 2 bullets but decrements the clip by 1. This has been adjusted accordingly • Various map fixes • Fix for the Phantom Rig’s “Ghosted” taunt not working properly if the player is in 2nd or 3rd place Shaolin Shuffle • Kung Fu bug fixes • Spawning/de-spawning updates to improve gameplay • Nunchuck balancing 4/21/17 Playlist Changes • Replaced Cranked with Grind for this weeks playlist • Moved all playlists from the special tab into standard tab The following are for PS4/Xbox • Moved all Competitive game modes into one playlist (CTF not included) • Merged Hardpoint and Team Defender into one playlist • Merged Frontline and Kill Confirm into one playlist General Fixes • Adjusted attacking spawns on Breakout so defenders have a slight time advantage to the Bomb A site in Showers • Scrap: Fix for dog tags clipping into the magnet after killing an enemy while playing Kill Confirmed • Various map fixes • All Gestures are now unlocked in local play • Adjustments to the reload speed of the VPR • Shockwave adjustments: Reduced the upward and downward damage area. Outward radius of the damage area is not affected • CWL: Breakout - Adjusted collision on the fan in Showers so players won’t be killed by jumping into it. 4/19/17 Small update to fix a few backend issues 4/17/17 General Fixes • VPR adjustments: Recoil and gun kick provide a little more consistency Damage adjustments Fixed a bug that would double up on hit markers Increased clip/stock size Decreased reload times • Various map fixes • Slide challenges: added a grace period to make slide medals and challenges easier to get • Fix for a bug where enabling and disabling Hardcore Mode would not correctly keep Respawn Delay values in sync for the mode • Fix for the player being damaged by their own Shockwave while using Reactive Armor • Disabling Gestures while in Phase Shift • CWL adjustments: Removed grace period times for Overdrive and Active Camo. This means you will no longer be refunded the Payload even if killed just after activating the Payload Lowered score requirements for all Payload weapons except Claw to make them more viable for use Banning silencers for all weapons 4/11/17 Featured Content and What’s New • Double XP Tokens available in the Quartermaster (use a 2XP token to double the XP of your previous match) General Fixes • The KBS-Longbow and TF-141 inflict different amounts of damage, which is inconsistent when comparing the weapon damage stats for both weapons. This has been fixed • Fix for kills made with an energy weapon and fusion mag were not tracking for the Extended Mags prestige challenge • Fixed an issue with tacking kills for the Blood Anvil “Ace” Mission • Fix for the ‘Time Played’ column in the Combat Record barracks not displaying the unit of time • Carpet Bomb challenge previously only tracked kills done by Scorchers. Progress may now also be obtained by using: Trinity Rockets, Bombardment, Warden, T.H.O.R, and AP-3X • Fix for the countdown timer not appearing while in control of the RC-8 in Cranked • Various map fixes • Adjustments to Active Camo visibility: Active Camo will now be slightly more visible, mainly while in motion • Fix for an issue where players entering an Infected match as a Synaptic so they don’t look like regular infected • Fix for yellow loading icon appearing in Search and Destroy while CODCasting • When firing from the hip with the VPR, the reticle would not appear red when close to an enemy. This has been fixed • Shockwave Updates: Increased non-lethal damage Slightly increased non-lethal radius of Shockwaves performed from low and moderate heights Slightly increased lethal radius of Shockwaves performed from moderate heights Greatly increased lethal radius of Shockwaves performed from great heights • Slide adjustments: Slightly reduced maximum initial slide velocity • Adjusted Search and Destroys spawns on Retaliation when defending. Defender spawns were moved forward to facilitate faster times to the bomb sites 4/5/17 General Fixes • If a player is in Phase Shift with another enemy and throws an Epic Axe (Headsman), the enemy does not take damage and the Axe will disappear. This has been fixed • Various backend fixes and adjustments • Karma-45 – Phobos/Deimos: Now play the correct sound effects when firing with a silencer equipped • Karma-45 – Deimos: Now correctly refills ammo when walking over another dropped Karma-45 on the map 3/31/17 General Fixes • Blood Anvil Missions Updates: Get X Kills with a Ballistic Weapon: now supports Visor Detonations from KBS Longbow – Bombshell and melee kills from the Reaver – Machete Get X Kills with an Energy Weapons: now supports alternate-mode kills (melee kills when not in the alternate mode will not count) from the R-VN and from the R-VN – Blowout gun perk, Overcharge. • Micro Turret Changes: Slightly increased the lock-fire delay Slightly reduced accuracy Slightly reduced health Slightly reduced target lost time • Fix for the Stryker body challenges earned by getting 2 kills with a single Micro Turret • Various backend fixes • MKII weapons now allow personalized camos • Fix for a bug that caused some Rigs to appear incorrectly in the menus after the last update • The counter for Tracker is Hardwired, which used to make the footprints disappear more than twice as fast. A recent bug was preventing this from happening. This bug has been fixed, but Hardwired will now make the footprints disappear even faster than it originally did 3/28/17 - Update Featured Content and What’s New • VO Packs – UK Special Forces, Method Man • Weapon additions: VPR and X-Eon General Fixes • Fix for game mode names appearing incorrectly in Moshpit • Various Leaderboard fixes • Reduced Tac Resist challenge from 75 to 40 • Grind adjustments: Fixed an issue where players were dropping 1 less tag than intended in some scenarios Updated default bank speed to 1s per tag Fixed an issue where the player could bank tags just outside of the visual radius of the bank Added an additional half second increment bank time option in Custom Matches • Clicking on the Message of the Day would change the Active Mission on PC. This has been fixed • Infected Knife Updates: Less lunge range and width. Players have to be a little more accurate when going to melee a target • Fix for a player’s Rig not holding a weapon after a playing a match and returning to the next pre-game lobby 3/23/17 General Fixes • Prep for upcoming featured modes • Various map fixes • Active Camo: Grace period reduced from 2 seconds to 1 second (if you trigger your Active Camo and get killed within 1 second, your Payload will be refunded) • Fix for the bomb not resetting if dropped in the pit while wall running in the Tower Wallrun area of Crusher • Fix for the Type-2 having less than two magazines of reserve ammo • Increased the strength of the P-LAW against scorestreaks 3/17/17 - Playlist Updates• Mission Team Double XP until Monday, March 20th• Removed Drop Zone and replaced it with Demolition until March 24th• Added Hardcore Domination and Hardcore Search and Destroy back into the playlists 3/16/17 - Patch• Prep for this weekend’s game modes• Bug fixes for the Winner’s Circle• Fixes for the Message of the Day• In Uplink, players were unable to score points by throwing the drone into the goal if the time limit was set to unlimited. This has been fixed• EBR-800- Bomber – Increased recoil of the last shot. Reduced return speed of the recoil. Increased delay between bursts.• Fix for the Howitzer not doing full damage to scorestreaks 3/14/17 Update Featured Content and What’s New • Emblem Editor • Master Prestige Ranks • 20 additional Prestige Ranks Each new Prestige Rank grants permanent bonuses. Bonuses include: Extra XP from challenges (including Camo challenges) The ability for Classic weapons to earn De-Atomizer Strikes Extra starting ammo for Classic weapons Additional XP for using MKII weapons As well as new rank icons, Emblems, and Permanent Unlock Tokens General Fixes • Fix to enemy names not always appearing on-screen during Killcam • Audio fixes for Intel Logs in Campaign • Fixes to party indicators not appearing properly • Audio fixes for MP and Zombies when having two profiles logged in on PS4 • Gun Perk: Readiness – now reloads faster when mag is low instead of when mag is empty • Fix for the Weapon Level Up indicator not displaying properly mid-match • Camo adjustments for the Hailstorm • Fix for the Axe not appearing properly in the player’s hands when using the Synaptic’s Rushdown Trait • Fix for the Synaptic using a different gesture instead of “Rock, Paper, Scissors” when viewing in 3rd person • Various map fixes • Fix for an issue where trophy systems could deflect a passed Uplink or Defender drone • Fixed an issue where enemy scorestreak callouts would not play in FFA • Fix for a bug where the Rigs would be facing the wrong direction in the Winner’s Circle 3/9/17 General Fixes • Various map fixes • On occasion, players who have the R-VN, Axe, or UDM in a loadout would no longerhave access to the weapons if a host migration occurs. This has been fixed. • Added the R-VN, UDM, and Axe in Epic Gun Game • Fix for an issue where Season Pass holders on Xbox One were not able to download Sabotage DLC from in-game • Fix for the Epic UDM doing too much damage in TTDM. This now matches the same damage rules as sniper rifles in TTDM. • Fix for some users receiving the ‘weapon_graitonsuper_wm’ error after the last update • Type-2 (AR mode) – Slight increase to the fire rate and a decrease to ADS recoil • Type-2: Slight increase to hip fire spread when in akimbo mode • Volk – Increase to the 3 bullet hit kill range • Titan – Slightly increase to the fire rate and an increase to the 4 bullet hit kill range • KBAR – Slightly decrease to the 4 bullet hit kill range • NV4 – Slightly increase to the ADS recoil • R-VN: Increase to the 3 bullet hit kill range • Widowmaker – Reduced delay between bullets within the burst • DMR – Slight decrease to the ADS time • EBR-800 (AR mode) – Increase to the 5 bullet hit kill range • EBR-800 (Sniper mode) – Reduce ADS sway speed • Howitzer changes: Explosion radius increased. Explosion damage more consistent. Damage to scorestreaks increased. VFX updated to better represent the explosion radius. Fixed a bug where the projectile would play an explosion VFX without doing any damage. Fix a bug where the projectile could still explode after bouncing off a surface • Steel Dragon - Reduced sprint out to fire time • Fix for the Axe camo challenges not tracking progress • Fix for an issue where it would take 6 shots to a player with a Blast Shield with the Howitzer in Hardcore • Added the R-VN and UDM to regular Gun Game • Uplink: Fixed an issue in Overtime where the goal VFX and team score would increment even though the scoring team lost the second round of overtime • Taunt combo system added to the Winner’s Circle • Fix for the Sage Phantom head not appearing correctly when viewing in 3rd person 2/28/17 Update Version 1.10 - Xbox and PS4 Featured Content and What’s New • Show the last weapon used in Winner’s Circle instead of Payload • 360 Rig Rotation in customization menu • New weapons added to the Quartermaster • Use of four Taunts instead of just one • Simultaneous Deaths/Kills: This allows players to kill one another with ballistic and energy weapons at the same time. For example, if two players with low health fire at the exact same time, both players will die. The same would apply if two snipers headshot each other at the same time. • Simultaneous Deaths/Kills: When this occurs, you’ll not only see it happen in the bottom left obituary, but you’ll also get a Medal called “Trade”. This is called “Kill Trade” in the options menu and will be defaulted to OFF in Custom and LAN. You can turn it on under the “Game” tab in CODCaster General Fixes • Fix for late players being shown as in a party even though they aren’t • In FFA style modes, players would appear on colored teams in the lobby. This has been fixed • Fix for various bugs that can occur after a host migration • Fix for players appearing in 1st place despite losing in a FFA match against bots • Bug fixes in the After Action Report Medals tab • Fix for the weapon indicator at the bottom of the screen showing the wrong weapon after respawning in HC SnD • On occasion, the scoreboard would briefly display a player’s score as the team score if the player had their scoreboard open during a round transition. This has been fixed • Backend bug fixes • Grind score limit is now 65 (was 85) • Friendly Fire will now be disabled in Competitive playlists Rave in the Redwoods • Fixed a bug where mission rewards could show up incorrectly in the zombies menu • Fix for a bug that would remove the icon a player had crafted if a host migration occurs • Added 200 ranks and 10 new rank icons • Added the R-VM and UDM to be unlockable for use via the Magic Wheel 2/14/17 - 1.09 Update Featured Content and What’s New • Lobby Party Indicator • Showing team balance in pre-match lobby • Combat Record General Fixes • General fixes for bugs found in Leaderboards • Drop Zone: Score limit increase from 600 to 750. Adjustments to hill rotations. Removed high tier streaks from the first hill to prevent an unfair advantage at the beginning of the match. All hills after the first have a chance at all streaks regardless of tier • Infected and Gun Game: Allow for player customization. Infected will still replace Synaptics with a random default customization. Infected now increase match timer on Survivor suicides • Slight decrease to the Vulture’s overall speed and acceleration. Slight decrease in damage of the Vulture’s turret • Fixed crashes and performance issues that could occur when viewing videos in MLG.tv • MLG.tv will now show if a livestream is a replay • Fixed green screen that would sometimes appear when exiting the MLG.tv menu • Fixed players knees clipping into player view if they sprinted while jumping from boost jump height • Uplink fix where players could pass the drone through ha short wall in Terminal • Fixed a scrolling issue while in the armory • A player with the Tracker perk equipped was unable to hear another player boost jumping with the Dead Silence perk equipped. This has been fixed • Removed showing the public rank in private or system link pause menus • Fixed Steel Dragon damaging a player with Charge Shield • Fixed a bug where incorrect information about a player could be displayed in the MP lobby • Fixed damage feedback icon for not displaying the first time in a round Xbox One • Fixed an issue that would cause a player to get removed from the local party at an inopportune time Zombies in Spaceland/Rave in the Redwoods • Fixes for players losing their weapons when Pack-a-Punching (ZiS) • Several out of map exploits fixed (Rave) • Fix for being able to replenish ammo after putting the harpoon back in the cabinet and picking it up back up • Fix for random dancing zombies that could remain after the music has stopped • Fix for various zip line bugs that could occur • Fix for a bug where splitscreen players didn’t have access to options in several menus • Other miscellaneous bug fixes CWL/CODCASTER • Added an option for players to select how much time they’ll allow for players to edit their loadouts in Rig draft from 0-75 seconds • Fix for yellow loading icons appearing during CODCaster mode • Players were able to start a CWL match with 5 players on a team, but only showing 4 on the draft screen. This has been fixed to only allow 4 players maximum while allowing 1v1, 2v2, 3v3, and 4v4 • Fix for a bug where a player would see incorrect text when hovering over a Rig that another player has already selected • If a player changes their Rig after selecting their Payloads, the CODCaster would only see the updated Rig, not the updated Payloads. This has been fixed • Fix for teams appearing on the wrong side of the loading screen if teams were unbalanced 2/3/17 - PC will get the latest update on February 14, pending any issues during our testing. Featured Content and What’s New • Demolition Game Mode: February 3rd-10th • Double Key Weekend: February 3rd-6th • Added Hardcore Sabotage Moshpit in DLC tab • Added Sabotage TDM in DLC tab • Kept a Sabotage Moshpit playlist in DLC tab General Fixes • Fix for an issue where switching from one trait to another during round based modes, the new trait would not work • Fix for players being able to reach an out of bounds area of the map on Dominion • Fix for the trait icon appearing incorrectly during a killcam if the player selected a new trait midlife • Reduced kill requirement from 3 to 2 for a single shot of the Gravity Vortex for the Rig body unlock challenge • Tracking Payload streak kills will continue to count kills after the user has died or the weapon has been put away. This fixes an issue where players were unable to have the second shot from the Gravity Vortex count towards their streak kill progress • Phase Shift cooldown has increased from 60s to 90s • Rewind cooldown has increased from 60s to 90s • Overdrive cooldown has increased from 70s to 90s • Gravity Vortex cooldown has reduced from 310s to 290s • Reactive Armor health was reduced from 133HP to 114HP • Reactive Armor duration has been reduced from 9s to 7s • Active Camo duration has been reduced from 10s to 7s • Pulsar cooldown increased from 120s to 150s • Pulsar marked time has been reduced from 6s to 5s Weapons • Hailstorm: Decreased fire time between bursts. Slight increase in damage range • DMC-8: Slightly increased damage and damage range • DCM-8 – Masochist: Lifelink Perk Updated – Large mag size. Taking damage fully regenerates mag. • Banshee – Siren: Shockwave Perk Updated – Improved damage while sliding. Damage causes hearing loss • EBR-800 – Osiris: Hunter Killer Perk Updated – No sniper glint. Enemies at low health are highlighted • Kendall 44 – Cartel: Secondary perk changed to Stability • DMR-1 – Spectacle: Reflex Perk – Built in custom Reflex Sight now has Tracking Chip and improved ADS time for all scopes • Rack-9 – Smoothbore: 1 shot kill zone at mid-range now includes lower torso and upper arms • Kendall 44 – Advantage: Secondary perk changed to Steady • Mauler – Mammoth: Slower Aim Down Sights and reduced movement speed • MacTav -45: Slight increase to recoil when firing ADS • M1: Slightly decreased return speed when firing ADS • Howitzer Direct Impact kills have been fixed Zombies in Spaceland/Rave in the Redwoods • Fix for Spaceland camos appearing instead of Rave camos when a player upgraded weapons using a PAP power-up drop • Fixed issues with Wall Power and Super Minute Man • Fix for the “Purify” Fortune Card not properly displaying it’s in-game effects “On activation, players and teammates are healed and cause an explosion that deals damage to nearby zombies.” • On occasion, players would not be able to melee or crouch after using a zip line. This has been fixed • Fix for splitscreeen players not earning keys • Fix for Harpoon Gun kills not counting towards the “Assembly Required” Soul Challenge • Rank progression widget is now viewable in the Pause menu • Slasher Saw exploit fix • Several out-of-map exploits fixed • Hasselhoff is now selectable • Key earn rate has been slightly increased • Various splitscreen HUD fixes CWL/CODCASTER • Fix “Previous” and “First Person” button prompts overlapping while spectating 1/27/17 - Update 1.08 - Thank you all for your feedback and patience since our last update! Complete new missions to achieve Commander Ranks! Each Mission Team now goes up to Rank 100! Once you hit that level 50 rank, you’ll go on to chase after a Commander rank until you reach Mission Team Commander Rank 100! New ranks better rewards, so Commander Ranks will reward you MKII versions of Mission Team-only Prototype weapons once achieved. You can also craft more! Commander Ranks reward salvage every level you rank up as long as that level isn’t giving you a MKII Prototype reward Features Update • Leaderboards – Today! • Combat Record – Late February • Emblem Editor – Late February Featured Content and What’s New • 2XP and 2X Weapon XP in MP and Zombies until February 3rd (all platforms) • Hyper Team Deathmatch until February 3rd: Payload charge rates are bumped to 7x their normal speed (all platforms) • Call of Duty World League Personalization Pack • Barracks now include a section for Medals General Fixes • Added ability for both splitscreen players to change their own Missions in the lobby before a match starts • Safeguard against jitter mod exploits • Defender: Fix for exploit that could occur if a player using Rewind spawns on a newly spawned Defender drone, allowing the player to carry their gun as they carry the drone • Adjusted Taunt menu to wrap to the bottom of the list • During the final killcam, the team emblem shown was the emblem of the user who died rather than the player who got the kill. This has been fixed. • Hardcore Search and Destroy: Fix for “Friendly Fire is not Tolerated” displaying after every round for the remainder of the game • Added ability to equip Calling Card and emblem after acquiring them from a Supply Drop • Camo challenges involving Direct Impact kills with the Howitzer were not tracking. This has been fixed. • Various updates to weapon camos • Fix for players SPM not being calculated correctly in some instances • Camo adjustment for the MK2 R3k not covering the right side of the weapon • Allow players to skip Mission Team videos even if it’s their first time seeing them • Fix for the KBS Harbinger reload animation playing twice while holding down both triggers • Fixed an issue where the Jammer Grenade was not damaging scorestreaks correctly • Fixed an error a player would receive when attempting to edit a class with the OSA • Fix for an issue where players with akimbo weapons were immune to the Steel Dragon CWL/CODCASTER • Fix for team colors not appearing the proper shade • Added CWL specific game mode icons • Fix for Cold Blooded not affecting Thermal Scope for Casters (Xbox) • Adjusted the position of the gamemode icon so the Uplink image does not stretch • Removing the required number of players for CWL matches • Allow for multiple casters in the same lobby 1/20/17 - Patch General Fixes • Infected: Fixed an issue where players can respawn looking like Infected after suicide • Infected: Restored boost values to previous settings based on community feedback • Infected: Map Vote in lobbies now display the game mode name, to allow players to know what they’re voting on for Infected and Mosh Pits • Search and Destroy: Scorch – Adjusted B bombsite to fix an issue where players can plant behind a crate • Search and Destroy – Fix for an exploit when viewing killcams – we now hide the options menu minimap when the player is dead or watching a killcam so they can’t see the bomb carrier • Hardpoint: Updated start spawns for Precinct • Custom and LAN Options: Adds in Tactical and CWL tuning options in Custom and LAN games • Custom and LAN Options: Tactical option will make any mode play with Tactical adjustments • Custom and LAN Options: CWL tuning option will allow any mode to play with CWL adjustments to Rigs, Traits, Payloads, Energy Weapons, Hybrid Weapons, etc. • All or Nothing: Fixed an issue where players were not receiving the boost, slide, and wallrun movement abilities when this mode was toggled • Weapon sprint out times have been slightly increased by weapon class. Gung Ho still has fast sprint to fire times • Epic Gun Game has been removed and original Gun Game is now in the Special tab • Added Drop Zone to Featured tab • Exploding Drone: Slightly increased movespeed. Increased base health from 1 hit to 2 (1 with a sniper or shotgun close up). Increased rugged health from 2 hits to 3 (2 with a sniper or shotgun close up) • Fixed an issue where Payloads could be activated on the frame of death • Care packages no longer reflect friendly fire damage back at the owner • 2XP for PC/UWP 1/18/17 - PC/UWP • COD Points enabled across all PC Platforms 1/16/17 - Playlist Update • Frontline and Defender have been removed from the Featured playlist and have been added to the Standard playlist • Hardcore mode is back to being Ricochet by default • Competitive playlist is now back to normal rules while we create a new ruleset that features penalties for friendly fire 1/13/17 - Patch - 9:45PM PST • Fix for Cryo Mines not functioning properly • Fix for some Killstreaks not damaging enemy players 1/13/17 - Patch General Fixes • Slight increase in Black Hole radius • Added the map Grounded back into rotation • Players who deploy a Black Hole will receive assists if an enemy is killed while being pulled in • Players receive assists if the enemy the Seeker Grenade is tracking is killed • Increases to Micro Turret health, ammunition, and fire rate • Infected: If a player waits to spawn in to avoid being the first Infected, they’ll be forced to Infected • Infected: Fixed an issue where the first Infected wasn’t getting the proper score or XP for the first kill • Infected: Kills/Deaths are no longer stored after a match so KD is not affected • Infected: Boost jump recharge is now slower • Gun Game: Increased the throw distance for the Bio Spike • Gun Game: Kills/Deaths are no longer stored after a match so KD is not affected • Fixed an issue where the player couldn’t capture the next Hardpoint if they are in a Scorestreak • Fixed an issue where the Hardpoint was being contested but the icon was in a red capture state • Howitzer headshots were not counting towards camo unlocks. This has been fixed • Fix for available Payloads such as Reactive Armor requiring another score update after round switch to re-earn • Killcams now show Traits, Tacticals, and Lethals • Reduced recoil of the R3K when zoomed in using the VMC • Slight increase to Quick Draw speed with snipers • OSA Launcher: Updated inner and outer damage, and damage radius to reduce lethality in Tactical TDM • Howitzer: slight adjustment to increase lethal radius and overall radius. Increase projectile speed and reduced projectile up velocity to help with targeting • Fix for the Hit ad Run Gun Perk on the Epic Kendall-44 showing as an attachment in the weapon name • SMGs: Increased hip aim assist range to 800 inches. Increased ADS aim assist range to 1400 inches • FHR 40 and RPR Evo: Increased ADS aim assist range to 1200 inches • MacTav-45: Increased ADS aim assist range to 1500 inches • Shotguns: Increased hip and ADS aim assist ranges to 600 inches matching the max damage range • Fix for an exploit where using the Killstreak map could be used every round as a free UAV • Fix for the “A” bombsite on Retaliation that would cause a player to unintentionally move when next to the bombsite • Fix for the “Out of Bounds” that would trigger when near the theater and bowling alley on Throwback • Updated the start spawn for Precinct Hardpoint and Uplink • 15 spots on Rooftop near Drop Pods and Construction have been fixed in Precinct • Scorch “B” bombsite moved to the back of the drill (from attacker side) CWL/CODCASTER • Fix for an error when attempting to change team colors, name, and icon • Removed Payload delay at the start of a round • Active Camo duration has been reduced from 10s to 5s • Reactive Armor duration has been reduced from 9s to 6s • Bull Charge duration has been reduced from 6.5s to 5s • Reactive Armor value slightly lowered • Rewind: Only Rewinds a portion of the player’s health. Still rewinds full ammo • Overdrive: No longer restores player health on activation • Holding the Uplink drone or planting/defusing in CWL rulesets no longer drain your Payload faster as the base duration times have been adjusted • Removed Killstreak spawn protection 1/11/17 - Update General Fixes • Fix for the Mad Hax taunt in the Winners Circle • Allow players to change classes up with 5 seconds after prematch is completed • Fix for the Diamond, Solar, Slime, and Black Sky camos glowing when using the Type-2 akimbo in the left hand • Fix for various camos not applying correctly to the Epic Karma-45 • Audio adjustments for louder impact sounds when being shot • Fix for an issue in MP split screen where one of the two players will load into the match without their Perks being shown • Fix for friendly players not appearing on the minimap when manually controlling the R-C8 • Added a popup for the daily login bonus if you’re signed in while the bonus is given and also adding a sound when the daily login Message of the Day is displayed • Private/custom matches are now “invite only” • Fixed an issue where disabling the Team Assignment option would still require the player to select a team in a custom game • Fixed an issue where rewards for ranking up a Mission Team in MP were appearing as a blank card in the After Action Report • When being killed by a De-Atomizer strike, players would see a blank icon in the killcam where they should see the last weapon they were killed by. This has been fixed. • Fixed an issue where a user would complete a challenge in the Victories Challenge section, but the XP for the challenge wouldn’t be shown in the XP Earned in the After Action Report • Fixed a bug where the High Score challenge wasn’t working properly • Allow for the loadout menu to scroll to the top when reaching the bottom of the menu • Adding popup when trying to equip a streak when all streaks are already full • Fixed a bug where the Steel Dragon would penetrate a player using Bull Charge • When using the Scarab, friendly names were not appearing. This has been fixed • Fixed for a bug where the player in first place would appear cloaked in the Winners Circle • Fixed a bug where in MP splitscreen, the health bar of the second player wouldn’t decrease during a killcam. This has been resolved • Fixed an issue where the stats of your last match were always followed by a 0 in the Performance tab. This has been fixed to remove the 0. • Audio adjustment for audio playing late during a cutscene during the Dark Quarry mission in SP • Various map exploit fixes • Adjustments to some bomb pickup locations so players don’t have to circle back • Fix for the Type-2 Butcher akimbo shotgun mode where the energy projectiles were reflecting • Fixed the collision with the clock face and bowling entrance corners for the Uplink drone on Throwback PC • Fix for players being able to receive text communications from another player that has been blocked • Fix for keyboard navigation being inverted while scrolling through the player list in public lobbies • Various adjustments for mouse sensitivity • Fixed a bug where a player would be unable to edit a primary and secondary weapon by using the mouse to click in Create a Class • Various security and anticheat updates • Fixed for a player not being able to dodge backwards using Rushdown while using a keyboard and mouse with default bindings CODCASTER • Moved objective status to top of the screen • Fixed an issue where killstreak iconography would overlap with UI • Size adjustments to minimap • Added the ability for the caster to back out of a CWL draft in-progress • Added the boost meter to the in-game HUD when casting • Increased character limit for Team Identity to 12 • Allow for the host to not be set as a caster Zombies in Spaceland • Various bug fixes • Select Epic weapons that weren’t working properly in Pack-A-Punch have been fixed Xbox One/S • Performance improvements while in splitscreen 1/13/17 - Patch - 9:45PM PST Fix for Cryo Mines not functioning properly Fix for some Killstreaks not damaging enemy players 1/13/17 - Patch General Fixes Slight increase in Black Hole radius The map Grounded has been added back into rotation Players who deploy a Black Hole will receive assists if an enemy is killed while being pulled in Players receive assists if the enemy the Seeker Grenade is tracking is killed Increases to Micro Turret health, ammunition, and fire rate Infected: If a player wait to spawn in to avoid being the first Infected, they’ll be forced to Infected. Infected: Fixed an issue where the first Infected wasn’t getting the proper score or XP for the first kill Infected: Kills/Deaths are no longer stored after a match so KD is not affected Infected: playlist now includes shotguns, SMGs, ARs, and snipers Gun Game: Increased the throw distance for the Bio Spike Gun Game: Kills/Deaths are no longer stored after a match so KD is not affected Added a Mission Team option in the lobby so players can change mission teams without leaving a lobby Fixed an issue where the player couldn’t capture the next Hardpoint if they are in a Scorestreak Fixed an issue where the Hardpoint was being contested but the icon was in a red capture state Howitzer headshots were not counting towards camo unlocks. This has been fixed Fix for available Payloads such as Reactive Armor requiring another score update after round switch to re-earn Killcams now show Traits, Tacticals, and Lethals Reduced recoil of the R3K when zoomed in using the VMC Slight increase to Quick Draw speed with snipers OSA Launcher: Updated inner and outer damage, and damage radius to reduce lethality in Tactical TDM Howitzer: slight adjustment to increase lethal radius and overall radius. Increase projectile speed and reduced projectile up velocity to help with targeting Fix for the Hit ad Run Gun Perk on the Epic Kendall-44 showing as an attachment in the weapon name SMGs: Increased hip aim assist range to 800 inches. Increased ADS aim assist range to 1400 inhes FHR 40 and RPR Evo: Increased ADS aim assist range to 1200 inches MacTav-45: Increased ADS aim assist range to 1500 inches Shotguns: Increased hip and ADS aim assist ranges to 600 inches matching the max damage range Fix for an exploit where using the Killstreak map could be used every round as a free UAV Fix for the “A” bombsite on Retaliation that would cause a player to unintentionally move when next to the bombsite Fix for the “Out of Bounds” that would trigger when near the theater and bowling alley on Throwback Updated the start spawn for Precinct Hardpoint and Uplink 15 spots on Rooftop near Drop Pods and Construction have been fixed Scorch “B” bombsite moved to the back of the drill (from attacker side) 1/11/17 - Update General Fixes Fix for the Mad Hax taunt in the Winners Circle Allow players to change classes up with 5 seconds after prematch is completed Fix for the Diamond, Solar, Slime, and Black Sky camos glowing when using the Type-2 akimbo in the left hand Fix for various camos not applying correctly to the Epic Karma-45 Audio adjustments for louder impact sounds when being shot Fix for an issue in MP split screen where one of the two players will load into the match without their Perks being shown Fix for friendly players not appearing on the minimap when manually controlling the R-C8 Added a popup for the daily login bonus if you’re signed in while the bonus is given and also adding a sound when the daily login Message of the Day is displayed Private/custom matches are now “invite only” Fixed an issue where disabling the Team Assignment option would still require the player to select a team in a custom game Fixed an issue where rewards for ranking up a Mission Team in MP were appearing as a blank card in the After Action Report When being killed by a De-Atomizer strike, players would see a blank icon in the killcam where they should see the last weapon they were killed by. This has been fixed. Fixed an issue where a user would complete a challenge in the Victories Challenge section, but the XP for the challenge wouldn’t be shown in the XP Earned in the After Action Report Fixed a bug where the High Score challenge wasn’t working properly Allow for the loadout menu to scroll to the top when reaching the bottom of the menu Adding popup when trying to equip a streak when all streaks are already full Fixed a bug where the Steel Dragon would penetrate a player using Bull Charge When using the Scarab, friendly names were not appearing. This has been fixed Fixed for a bug where the player in first place would appear cloaked in the Winners Circle Fixed a bug where in MP splitscreen, the health bar of the second player wouldn’t decrease during a killcam. This has been resolved Fixed an issue where the stats of your last match were always followed by a 0 in the Performance tab. This has been fixed to remove the 0. Audio adjustment for audio playing late during a cutscene during the Dark Quarry mission in SP Various map exploit fixes Adjustments to some bomb pickup locations so players don’t have to circle back Fix for the Type-2 Butcher akimbo shotgun mode where the energy projectiles were reflecting Fixed the collision with the clock face and bowling entrance corners for the Uplink drone on Throwback PC Fix for players being able to receive text communications from another player that has been blocked Fix for keyboard navigation being inverted while scrolling through the player list in public lobbies Various adjustments for mouse sensitivity Fixed a bug where a player would be unable to edit a primary and secondary weapon by using the mouse to click in Create a Class Various security and anticheat updates Fixed for a player not being able to dodge backwards using Rushdown while using a keyboard and mouse with default bindings CODCASTER Moved objective status to top of the screen Fixed an issue where killstreak iconography would overlap with UI Size adjustments to minimap Added the ability for the caster to back out of a CWL draft in-progress Added the boost meter to the in-game HUD when casting Increased character limit for Team Identity to 12 Allow for the host to not be set as a caster Zombies in Spaceland Various bug fixes Select Epic weapons that weren’t working properly in Pack-A-Punch have been fixed Xbox One/S Performance improvements while in splitscreen 12/13/16 - Update General Fixes Fixed exploits on various maps Adjustments to the Message Of The Day Fix for a bug where players would experience a crash after loading into Frontier from a custom game Fix for a freeze that can occur during Single Player Fixed a bug for camos in the Create a Class menu Audio adjustments in the Emblems menu Fix for weapon accessories not appearing on the left Akimbo weapon Fix for the pre-match camera causing streaming issues when loading into Throwback Fix for users being unable to change teams, making the player unable to access spectate or CODCaster options in custom FFA games Created a fix for players not earning Keys after reaching max rank with Mission Teams (you can earn keys with a level 50 team!) Fix for an infinite loop that could occur if opening the game in an already running state Various visual adjustments to MP splitscreen when loading into certain maps Fix for the MP scoreboard briefly displaying a player’s score as the team score if the user has their scoreboard open during a round transition Allow for the rank meter animation to play again once a user confirms they would like to redeem a 2XP token Fixed a bug where the 3rd person player character did not face the correct way when airborne and shooting another player Fixed a bug in splitscreen where neither player could view the weapon models on occasion Hardpoint adjustments: Throwback - Removed \"Lime\" Hardpoint from rotation. Hardpoints 1-4 go in the same order: Train Platform > Barn > Bike Path > Baseball Field > repeat. The Hardpoint for Bike Path was slightly adjusted to not allow captures while wallrunning on the side of the bridge. Hardpoint adjustments: Breakout - Moved Visitor Room Hardpoint on top of the Visitor building (Central Rooftop) Xbox One Fix for a rare occurrence where a black flicker would occur after a match when in the post-game lobby Fixed a bug where select weapons would not auto reload when a player sprints Adjusted audio issues for users without headsets on and in correlation to whatever settings they have set up in Display and Sound Fixed an issue where users were not able to unmute players PC Fix for a bug in the advanced video option menus Fixed an issue where after a player removes their controller in the Create a Class menu in MP, it can cause the gamepad icons and buttons to still appear on screen Fix for the Enter Key when being used for keybinding Various performance and UI fixes Fix for an error message users might see after changing texture resolution options Fix for the personalization weapon kits button disappearing in Zombies in Spaceland Fix for exiting the game via the Main Menu that can sometimes cause the game to freeze CWL/CODCASTER Fix for a bug where if the caster rapidly changes from display to loadout settings or vice versa using keyboard shortcuts, the previous menu would reopen Ability to hide team logo and team name and in the scoreboard MP HUD when toggling off Team Identity • Fix for game rules no locking when selecting CWL rules. Allow for CWL rules to be edited but once an edit is made, the CWL tag will disappear Allow players to see the team colors of other players while in pregame lobby besides their own • Fix for XRAY customizations not being displayed once the game loads Fix for a bug where that match would not end while casting Gun Game or FFA matches with custom rules set to limited lives Fix for Uplink goal color while in “follow drone” spectating and performance fixes for the follow drone feature Allow Rig draft in private match Fix for minimap sizes in CODCaster Disabled the white UAV sweep that would occur on the minimap when in CODCaster Fixed a bug where players are able to use Payloads/Traits with the wrong character Added audio timer to Draft 12/9/2016 - Patch Zombies in Spaceland Update to kick timing MP unlocked camos from challenges are unlocked in both public and custom games in Zombies now. Added player nameplates Zombies Fix for crafting stations no longer working if a player disconnected while the machine was currently crafting. Objective and CWL Map Adjustments Precinct Uplink: moved start spawns on Garden side. Moved goal in Garden. Removed some aggressive rooftop resets around the Garden goal. Removed some 15 sports on the map. Search and Destroy: Moved B bombsite to under Contruction Frost Search and Destroy - Moved A bombsite towards mid-map on the cliff lane Moved Bomb pickup location closer to taem spawns by Cryo Throwback Search and Destroy: Moved A bombsite under the bridge at Bike Path . Moved B bombsite up against Silo. Uplink: Throwing the ball straight up doesn’t result in a reset. Goal near Concession adjusted slightly. Scorch Search and Destroy: Moved B bombsite closer to Drill. Moved ball spawns for Uplink and Defender Breakout Search and Destroy: Moved A bombsite to Showers. Moved B bombsite to Cliff Road near Medical Uplink: Removed some aggressive rooftop resets around the Cell Block rooftops to allow the ball to be thrown over Retaliation Search and Destroy: Moved A bombsite to Bridge Synaptic Traits Adjustments - CWL Rules ONLY Combat Burst: Time speed bonus remains active is 3s for CWL Propulsion: CWL RULES ONLY Time before thrusters start to recharge increased slightly. time for thrusters to recharge increased significantly. Changes put the trait more inline with Afterburner from BO3 Rushdown: CWL RULES ONLY 2.5s delay added to recharge time. Time between dodges is no 7.5s. Reduced speed and distance dodged slightly. FTL Trait Adjustments - CWL ONLY Power Slide: Extra slide distance removed CTF Exploit fixed. Will return next week. Uplink Slight adjustment to release angle and force behind throwing the drone This will allow the drone the be thrown a little farther and feel friendlier The goal ’pickup’ radie to grab the drone has been increased slightly to make throws feel a little friendler to score Make sure you head into Custom Games and turn on Practice Mode to get a feel for it! Hardpoint Revised Hardpoint spawn logic. Weapon Balance Mauler - Mammoth - Recoil increase R.A.W. - Increased hip spread. Slight recoil increase. Fists - No longer force a quick swap when in the secondary slot. This allows YY’ing to feel smoother. DMR-1 - Now a 1 shot kill to the head EBR-800 - Increased ADS recoil return speed to help with shot recovery Akimbo - Slight reduction in damage range. Increase in hip spread scale Kendall 44 - Increased hip spread Hornet - Increased hip spread Assault Rifles - Increased base hip spread for all ARs without special hip spread values. This includes the NV4, OSA, Type-2. OSA - No longer has reduced hip spread relative to other Assault Rifles. Inherits the new values set on Assault Rifles in this patch. Increased recoil to compensate for high fire rate being used at range. Kbar-32 - Increased hip spread values. These are still lower than the base Assault Rifle hip spread keeping with the weapon’s theme. No longer has a reduction in recoil off the first shot. Reduced 5 shot kill range. Volk- Slight reduction in recoil. Increased 3 shot range. R3K- Increased 3 shot kill range to help this weapon compete with other ARs General Fixes Fixes Thunderstorm not being unlocked for BO3 players - salvage refund issued to all players who crafted the Hailstorm prior to the BO3 incentive Double XP now applies to Match Bonus, Weapon Challenges and Challenges. Fixed an issue where camo challenges requiring a 3-streak only required a 2-streak 12/1/2016 - 6:20PM PST - Patch Fix for users not being able to earn XP since the last update 12/1/2016 – Update General Updates Fixed an issue to make sure the appropriate win/loss is given if the match ends before the forfeit timer finishes. Fixed several map exploits on the following maps: Skydock, Precinct, Frost, Genesis, Crusher, Terminal, Retaliation, Mayday, Throwback, Scorch, Grounded, Frontier Fixed an issue where Mission Team challenge progress would not display properly in round based modes. Fix for Warfighter ‘Ping’ Trait Challenge. Hardcore: Score popup is now shown in the HUD. Selected killstreaks are now shown in the HUD Fixed issues with the Nuke killstreak in round based modes. Fixed an issue where joining a match in progress and losing would end your win streak. Fixed an issue with force spawning users without a loadout selected in Custom matches. End of match combat now occurs in Uplink. Scoring is disabled once the match timer hits 0. Various winner’s circle updates and bug fixes. Infected updates: XP Updates - Survivors can earn more score / XP on kills. All Infected players now earn assist point whenever a Survivor is killed. Slowed down the Infected move speed slightly. Infected now have a red electric effect to better distinguish them from normal Synaptics. More weapons will be added in a future update, we promise they are coming! Fixed an issue to make sure the appropriate win/loss is given if the match ends before the forfeit timer finishes. Notification for the “latest” calling cards from drops Fix to Taunt menu selection and audio queues Fix for Orion Initiative Mission Team Commander congratulations call out after ranking up Fix for accessories not remaining equipped after leaving menu Joining a game in-progress and then losing no longer ends your win streak Adjusted overlap of text in Calling Card and Emblem menus The “Good Citizen” Medal is now correctly awarded to the player who owned the package, not the one who picked it up Fix for being awarded Scrap Assist points after dealing damage to a friendly Shock Sentry Fix for one of the Synaptic Taunts not appearing correctly Adjustment to the Banshee ammo counter animation Added ricochet to the Epic Oni prototype, Kaiken Fixed a bug where an error would occur after calling in a UAV Fixed a bug when holding a weapon and gesturing Fix for players being given Missions for Rigs that are not currently unlocked Fixed a bug where the Banshee – Siren wasn’t having an impact on other players after being damaged Fix for the HUD Uplink satellite drone icon not showing which team controls the drone while in splitscreen Fixed a timing bug where a turret would linger on a dead target before proceeding to target another enemy Fixed an issue where a player would get the wrong mission in a match Fixed a freeze issue when attempting to access the Store Fixed a bug where splitscreen users were unable to change their team or role in custom games Fix for a bug on Frontier where shadows would flicker in the hallway in splitscreen Adjusted the killcam when a player is killed by a Bio Spike on Frontier Vulture scorestreak adjustments: Turret damage increased. Turret fires faster. Min time between bursts decreased. Vulture movement adjusted to be more awesome. Added function to allow the user to rotate a weapon in the Loadout select menu Fixed a bug that would kick a player to the Main Menu when using the Steel Dragon Payload Fixed a bug for secondary controllers for users in splitscreen Fixed crash that would occur after map restarts Fix for users seeing repeat Rig videos Removed “Connecting to Matchmaking Service” text in Loadout menu after searching for a Public Match Fixed an issue in splitscreen where both users would be kicked from the Loadout Menu if scrolling through it at the same time Fixed a bug where users were able to temporarily gain access to locked Loadout slots Fixed a bug in splitscreen where a user who enters Prestige would see red on the screen and would cause the player to lose Create A Class functionality, revealing placeholder icons P-Law can now 1 shot UAV and CUAV Fixed an issue where the UI wasn’t displaying a few tiers for some of the Outfitter challenges Adjusted the death camera from penetrating into corpses on the map Fixed a bug on Genesis where the Vulture could get stuck inside of buildings Fixed a bug where bots would hover around the position of a dropped flag by the opposing team in CTF Fix for various overlapping texts in some menus Fixed a bug to ensure the location map for deploying Bombardment and Scorcher streaks wouldn’t be cut off when in splitscreen Fix for the cook timer being visually offset in splitscreen Fixed an error message and/or infinite loading screen after buying the Season Pass (only specific languages) Fix for possible stat loss when signing into the same PSN account on multiple consoles Fixed an issue the reticles on the DMR-1 Spectacle prototype are scoped causing the reticles to overlap the edges of sight in-game Various lobby merging lobby fixes Luitween Error fix – please let us know if you still experience this and where Splitscreen players will now be awarded Keys and Mission Team Rank Fixed a bug in the Quartermaster screen that would cause hitching after opening a drop Moved Gender Voice Option to Rig Appearance Menu Zombies in Spaceland Potential Luitween Error fix – please let us know if you still experience this in Zombies! Further work to ensure AFK players don’t stay in the game and continue to matchmaking The Headcutter damage exploit vs. Alien has been balanced Adjustment to pause menu visuals during splitscreen Xbox One Specific Fix for muting players via “View Gamercard” option Fixed hitching on Xbox while in a Private Party Fixed a rare audio related crash Fixed a bug where the title doesn’t transition into an active Zombies Custom Match that has been paused Fixed an issue where a player would be kicked from SnD for properly configured voice settings if the controller disconnects PC Fixed an issue where users with long usernames would overflow out of the boundaries of the match loading screen Fixed a bug where a user could exceed the 10 point Loadout limit Fixed a bug where special characters in a username would cause stuttering for other players Fixed the keybind option for Taunts in Winner’s Circle Fix for a framerate hitch that causes audio issues when a player progresses from one level to the next in SP Added mouse support to the lobby member slide feature Fixed a bug when text and voice communications were set to “block”, text communications were still displayed Fixed a bug where the game stop responding if a player switched from windowed to full screen Fixed a bug where multiple keybinds are getting unbound if a player uses the Copy Keys from mode to mode Fixed an issue where PC buttons will briefly display the old help buttons when disabling a gamepad COD CASTER/CWL Fix to 3rd person spectator showing zoomed in winner’s circle Add a sync intermission countdown with the host in CODCaster Adjustments to team colors/logos in CODCaster Fix for menus in CODCaster while in splitscreen Removing ricochet tracers for energy weapons in CWL Fixed a bug where changes to Team Settings in CODCaster would be reflected in the previous game’s match summary Added a “Follow Drone Camera” feature to CODCaster where the drone will be followed when thrown by the spectated player Fixed a bug where the Objective Status in the Display Settings is set to “on”, the screen would display red for allies and enemies Payload rate changes: Disable Payload charge over time. Adjust Payload Score modifiers for each mode to balance Payload earn rates from score actions Support for MLG.tv 11/21/2016 - Patch Notes Removal of 2XP icons Fixes for people with Max Mission Team Ranks not being able to earn keys Fixes for exploit in CTF 11/18/2016 - Patch Notes - 2:37PM PST Infected has been added back to all platforms Hardcore FFA has been added to all platforms Hardcore Kill Confirmed has been added to PS4 and Xbox Hardcore Kill Confirmed replayed Hardcore Defender in the Moshpit on PC Removed Hardcore Defender from PS4 and Xbox Reintroduced SnD into PC Moshpits 11/18/2016: 1:40PM PST– Patch Notes Multiplayer Scorestreaks now give team score based on where the owner is on the map in Frontline Double XP UI added Volk Tuning: reduced damage range, reduced hip fire accuracy, more violent ADS view kick Infected: Inactivity kick (Infected will be added back shortly) Infected: always turn initial infected to normal infected if a survivor suicides Frost: spawn additional out of bound trigger to catch dropped bombs by sub wallrun Rigs are now properly unlocked when ANY of their rig packages are unlocked, rather than just the first one. Speculative fix for a crash in the wild Fix for split screen weapon streaming Infected has been added back to all platforms Hardcore FFA has been added to all platforms Hardcore Kill Confirmed has been added to PS4 and Xbox Hardcore Kill Confirmed replayed Hardcore Defender in the Moshpit on PC Removed Hardcore Defender from PS4 and Xbox Reintroduced SnD into PC Moshpits Zombies in Spaceland Added a weapon rank upgrade splash when that weapon reaches a new rank. Don’t end the game in solo if The Hoff is active Correctly handle Coupon Clipper FnF card when used to call in The Hoff V3. Fixed an exploit where players can double jump after respawing from dying via a kill trigger. Weapon upgrade powerup fixes. Fixed an exploit where players who played both MP and CP would get drastically increased Weapon XP gain 11/11/2016 - DOUBLE XP in Zombies in Spaceland for a few days... Bang Bangs recoil reduced Trail Blazers damage buff Health tweaks to the Brute Arcane attachment damage buff Various fixes to the Alien boss fight Misc bug and exploit fixes Allow player to do exquisite quest before end of UFO EE Pause Spawning briefly when reviving from Afterlife Arcade in Solo Mode Fortune Cards Ordered by Rarity Fixed the Boombox exploding damaging the speaker in the DJ quest Melee Improvements Various UI Fixes Reduce Max Ammo Cooldown Attachment selection fixes with certain Prototype Weapons Various fixes for using certain combinations of perks, cards, and weapon attachments Fortune Cards are consumed if players leave a match before it ends Leaderboards were incorrectly summing scenes instead of posting highest Scene, this will be posting properly now. 11/11/2016 PATCH NOTES There was over 1,000 bug fixes in this title update across MP and Zombies this go around. Some were smaller and some larger well known issues that we received from you and your feedback, so thank you! MULTIPLAYER Fixes for Medals General fixes for Infected mode Removing CTF Flags in Winner’s Circle; adjusted session state change for games where there’s no kill cam Map exploits (we know some of you are reporting one on Genesis; we’re working on it) Removal of Taunts that weren’t supposed to be unlocked Localization formatting fixes Adjusted a challenge to correctly reference Propulsion rather than Rushdown Fixed typos Adjusted the challenge for killing players in the air just a tinnnny bit more lenient EAK ADS fire fix Fixed an issue where the 2nd player in splitscreen would not earn any Mission Team Progress Added a sound for tripmine projectile Fix for Synaptic death going through the ground Add a win to the top 3 players in FFA modes for leaderboard stats and show victory on the final win/lose/tie HUD Created more contract between the 3 Scorestreaks that are selected versus the ones that are disabled Adjusted points for score per bomb plant Fixed accessory collision on the R.A.W. Adjusted a Frontline spawn point on Riot due to intersection geometry Fix for previews of Mission Team emblems when they were still locked Adjusted gun camos FFA score increase from 50 to 100 Fixed the collision of the strap on the Karma from glitching through the other side of the gun DMR-1 – Epic- No longer supports the Variable Zoom Scope Enlarged the collision shape on cosmetics to prevent clipping with various weapons Fix for one extra frame of latency that was appearing in the muzzle flashes Fixed a bug where bots wouldn’t pick up crates in Drop Zone Fixed a bug where the Stinger would lock on to your own Killstreaks in FFA Fix for S&D crash Better win conditions that will prevent draws in Reinforce Combat Burst duration tuning for CWL CWL – adjustments to recipe for correct Payloud charge and score rates Fixed one known issue with framerate on Xbox One and various performance improvements – if you’re still experience this, please let us know Added Infected mode Adjustment to the Warden Killstreak on Breakout Pick 10 points are now blue Added ability to see the chosen Rig and mini combat record of others players in a lobby Zombies in Spaceland Fix for pap zappers having no ammo after you pick them back up off the standee Fix for pap zappers not having camo after putting back on the standee Fix for Brute having his helmet on incorrectly after removing it after he grabbed a zombie Fix for zombies who \"walk on air\" Fixes for certain cards with the Alien Fight Front end camera transition fixes Fix for the croc mouth (sometimes it wouldn’t return to its original height) Fix for seeing player outlines when they are playing emulated arcade games Allow clowns to be part of the \"kill marked\" challenges Make sure the Brute zombie doesn’t decide to grab/kill zombies who are marked for a challenge Fix for players being able to jump+sprint down the slide Add the soul key progression to the front end. Fix for players being able to repair a window from too far away and avoid being attacked Fix for N31L’s pause/unpause functionality being broken after letting him auto-pause due to multiple failed challenges in a row Fixed the occasional crawling zombie playing a standing death animation Reducing emissive on camos Give player a hit reward if melee’ing during Infinite Ammo 11/5/2016 PATCH NOTES Fixed a map exploit on Genesis Zombies Fixes, including exploit Fixing a joining in progress issue on Mayday Removing Redeem Code button from the store as it was causing confusion SMG Tuning from Beta\\Early metrics AR\\LMG Tuning from Beta\\Early metrics Slight tuning to Synaptic Equalizer values 11/3/2016 PATCH NOTES Recently met players list is disabled as we track down a bug Combat Rig Weapons\\Ability earn rates tuned based on Beta Metrics Clamping max player speed when stacking Perks\\Traits\\Gun Perks Buffing Killstreaks based on Beta Feedback (THOR, APEX, Bombardment, RC-8) – Mentioned in previous notes above. Small reduction to SMG movement speed Film Grain reduction for MP Miscellaneous fixes to gamemodes, medals. More weapon balance coming soon",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Nov 18, 2016 2:10:34 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/5/1/IW_MARK%20LOGO.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "5720",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10058654",
  "view_href": "/t5/Infinity-Ward-Blog/What-We-Learned-from-the-Call-of-Duty-Infinite-Warfare-Beta/ba-p/10058654",
  "subject": "What We Learned from the Call of Duty: Infinite Warfare Beta",
  "body": "Over the last two weekends, players from all over the world played in one of the most important testing periods for our game. We honestly cannot thank you enough for participating, sharing your feedback, and taking part in this journey with us. It’s been an incredible time for the team and we couldn’t have learned as much as we have without you, so thank you. During the Beta, we wanted to not only test a variety of new things such as our new matchmaking system, but we also wanted to hear all your feedback to help balance the game. We’ve been making adjustments since the Beta and below are the details on the changes you’ll see heading into launch day. Again, thank you for your support and we’ll see you online! WEAPONS We received a ton of great data from the Beta, allowing us to take a hard look at all of the guns and we will make changes as needed. Here are some of the immediate tweaks we will be implementing. Shotguns Increased the consistency of shotgun damage. Shotgun damage at longer range has been increased. Slightly increased the one shot kill range. Both the Reaver and Banshee have received a slight bonus to their 1 trigger pull kill range. Snipers Bullet spread at the hip no longer gets smaller as the player ADS’s. Once the scope reaches the player’s eye, the bullet spread goes instantly to zero. Sniper aim assist was reduced slightly for the KBS Longbow and the other bolt action snipers. Our turn rate while Aimed Down Sights is still slowed to help with precision aiming. Sniper-class weapons no longer have any Aim Assist until the optic fully reaches the player’s eye. For the ELO and Scout optics on snipers, the idle sway while ADS has been increased along with the player’s view bounce when moving. Because these optics are less zoomed in, the view bounce and the sway are felt less. These changes are to promote more stationary aiming and firing with these optics. The Tracking Chip optic’s visuals have been improved. Reduced bonus of the Quickdraw attachment on snipers. Updated snipers to have more flinch when getting shot. Launchers The Howitzer Grenade launcher can now be fired from the hip instead of requiring full ADS SMGs The RPR Evo epic variant (Ripper) has had a tuning pass to increase recoil given its bonus fire rate PERKS & RIG TRAITS Marksman – We fixed a bug where, in addition to reducing flinch, it was also reducing recoil. This would then stack with Gun Perks and the Foregrip Attachment. This bonus reduction has been removed. Momentum – Fixed issues with speed not being retained Marked Target – The temporary red marker on the victim has been toned down HEALTH REGEN AND SPAWNING Health Regen time has been reduced. Infusion bonus reduced. Continuing to refine spawn system on beta maps, will assess remaining launch maps in live environment. ECONOMY Increased salvage gain in mission teams. Changed currency value in supply drops. Increased drop rate of keys in round-based modes. SCORESTREAKS AND RIGS Scorestreaks AP-3X: Increased health, bullet damage, and weapon accuracy up close to help with target acquisition RC-8: Increased health, increased weapon accuracy to help with target acquisition, slight increase in fire rate, and slight damage increase on splash damage T.H.O.R: Increased speed of tracking rockets Increase damage of both tracking and straight fire rockets Bombardment: Slight decrease in both time to the initial drop and the time between each subsequent drop Updated area damage to be consistent inner to outer Rigs Refining payload balance Slight tweaks to gameplay balance across rigs MODES Defender: When carrying the Drone, the score-per-second bonus has been bumped from 5 score per second to 10 score per second. Scorestreak carrier bonus is unaffected. Gun Game: Now features all classic weapons. In future updates, weapons with alternate functions will retain their state upon spawn. Domination: When you step off a flag, the current capture bar progress starts to decay. The rate of this decay has been halved from the Beta. This allows players to hop off a flag to defend it and then get back on the flag with less progress loss MATCHMAKING Potential player evaluation was too strict. We were doing some very thorough testing of your connection to other players before placing you in a lobby with those players. This turned out to be a bit too thorough, and eventually was relaxed, leading to shorter matching times. Incorrect geographic categorization. There was an issue in our geolocation system which was causing some players to be incorrectly categorized. This was also resolved during the beta, improving matchmaking times. Dead lobby cleanup. The process which cleans up unused or dead lobby information from our back end was taking too long. This was causing a number of slowdowns when searching for a match. The matchmaker was always quite good at generating new lobbies, but one thing we noticed was that queueing into a join in progress situation was taking much longer. This was due to some issues in the way we track information about the lobbies that are currently playing a match. These issues were also addressed during the beta, and sped up the join in progress case immensely. TTK (TIME TO KILL / ENGAGEMENT) We know a lot of you had different experiences with TTK during the Beta. With the above adjustments to dedicated servers, matchmaking, and weapon tuning, we think you’ll find that the TTK will be more balanced at launch, both on the attacking and receiving end. We’ll continue to monitor and balance throughout the year as need and would love your feedback in the process. We’re always looking at TTK and will continue to balance and monitor. DEDICATED SERVERS One of the major infrastructure changes we made this project was how dedicated server allocations work. We’re using a new load balancing system on the servers themselves, as well as pretty heavily changed how the game chooses a datacenter to use, and requests a dedicated server from that datacenter. At the start of the Beta, you may have noticed some host migrations and some poorer quality matches. We discovered some issues where the new system was dropping our dedicated server utilization numbers way below target. After some tweaks and fixes we were able dramatically improve our dedicated server utilization for the second weekend and beyond. Thanks again for all your support. We look forward to your continued feedback on all of the above and look forward to heading online to play starting November 4th. For more intel about Call of Duty: Infinite Warfare, be sure to visit CallofDuty.com and follow @CallOfDuTy and @infinityward on Twitter.",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Nov 1, 2016 8:20:50 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/4/1/CoD_Beta.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "812",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10046658",
  "view_href": "/t5/Infinity-Ward-Blog/Welcome-to-the-Call-of-Duty-Infinite-Warfare-Beta/ba-p/10046658",
  "subject": "Welcome to the Call of Duty: Infinite Warfare Beta!",
  "body": "The clock is ticking, and every second brings us ever closer to the launch of the Call of Duty: Infinite Warfare Multiplayer Beta. The first weekend of the Beta will kick off on Friday, October 14 at 10am PDT / 5pm GMT on PlayStation 4, and Infinity Ward has provided some inside intel on what you can expect. It’s worth noting that while some things will feel familiar to Call of Duty veterans, there is also a ton of new stuff in here. So read on for a primer that will prepare you for the beta launch and beyond. COMBAT RIGSOne of the biggest additions to Infinite Warfare Multiplayer is the introduction of Combat Rigs. These are combat systems, or suits, chosen and worn by the player that provide a customized suite of tactical options. The Rigs are inspired by six distinct playstyles and are swappable mid-match to help you take a different approach to the game as it unfolds. Each Combat Rig can be equipped with one Payload and one Trait. Payloads are weapons or abilities you can activate mid-match once earned, and they bring an immediate boost to your Rig. Traits are persistent passive abilities that open up strategic gameplay opportunities based on your playstyle. You can unlock three Payloads and three Traits on each Combat Rig as you progress through the game. When the Beta kicks off next Friday, you will be able to get your hands on three of the six different Combat Rigs that will be in the game at launch on 11/4. Let’s take a closer look at them: WARFIGHTER Designed for a mid-range assault-style player, equip the Warfighter rig to support the team by getting fast kills, quickly getting to an objective, and always being on the offensive. Payloads Claw Powerful spread-shot weapon. Fires bullets that can ricochet around corners. Combat Focus Allows you to get double points for a limited time, getting you to that scorestreak even faster. Overdrive Gives you a speed boost. Traits Ping Kills and assists send a ping that highlights nearby enemies. Persistence Scorestreak counts don’t reset after death, but cost more. Resupply Lethals and tacticals can be resupplied by scavenging supplies from downed foes. MERC This imposing suit is equipped with payload options designed to clear enemy threats quickly and with authority. Its focus is heavy defense and suppressive fire. Payloads Steel Dragon Heavy beam weapon that can target multiple enemies. Bull Charge Armored riot shield that destroys enemies as you charge. Reactive Armor Electromagnetically charged armor that shields you from enemy fire. Traits Infusion When triggered, regenerates health quickly after taking damage. Man-At-Arms Heavy weapons won’t slow you down, and you start with maximum ammo. Shock Wave Slam yourself into the ground and enemies with this devastating jump. SYNAPTIC A C6 Class remote-operated droid optimized for speed and close quarters combat. Payloads Equalizer Dual under-arm machine guns with built-in suppressors for close quarters combat. Rewind Rewinds your position and replenishes health and ammo. Reaper Switches you into four-legged, rapid melee combat mode. Traits Combat Burst After each kill, gain a boost of movement speed. Propulsion Jump pack that recharges quickly and allows you to damage enemies underneath you with the blast from the jump pack. Rushdown Allows you to dash in any horizontal direction. Please note that Payloads and Traits are unlocked via progression and therefore not all may be available during the Beta. MISSION TEAMSMission Teams bring a metagame to Multiplayer in Call of Duty: Infinite Warfare. By completing missions while enlisted in a team, you will earn a team rank. Complete those missions with honors, and you will earn extra experience towards your rank. Each team has a unique commander who will deliver missions to you, and comment on your success or failure. Ranking up will give you rewards from that team, including calling cards, camos, emblems, unique Rig cosmetics, as well as specific prototype weapons that are only available from that team. In the Beta, players will get to experience two of the four Mission Teams, and will be able to enlist in the JTF Wolverines when they start the game. Their motto is “First in the Fight,” and this team and their commander favor aggressive combat. Also available as players progress will be the Orion Initiative, who go by the creed “Vigilance to Victory,” and bring their organized strategy to objective based missions. MAPSCall of Duty: Infinite Warfare offers a variety of maps that are optimized across the board for different types of engagements and game modes. Here’s a look at three of the maps that will be in the Beta: FRONTIER Circular, two-lane, fast-pacedFrontier is a small section of a giant space station that is in orbit around the planet Neptune. The action is funneled down a long, central corridor with side paths offering an element of strategy and a constricted lower lane for players craving chaos. FROST Linear, three-lane, medium-pacedA research facility set atop the icy surface of Jupiter’s moon Europa. Ample opportunities for vertical combat and rapid encounters around sleek modular elements highlight this frozen battleground. THROWBACK Bent, three-lane, medium-pacedThis throwback 1950’s ‘Main Street USA’ locale sits on a giant, rotating, torus-shaped space station. A large circular lane rings the perimeter, while a large center square with multiple avenues of approach and two opposing windows offers a wide range of engagement opportunities. MODESFan favorite modes including Team Deathmatch, Domination and Kill Confirmed will be rotated throughout the Beta, along with some surprises like the new Defender mode: DEFENDER High-stakes game of ‘keep away’Your team must grab a drone and defend it, gaining points while holding on and keeping it out of enemy hands. Teamwork is essential here in order to make sure your points add up until the drone resets and the cycle starts again. You’ll get all of this and more in the Call of Duty: Infinite Warfare Beta, including many new weapons, scorestreaks, lethals, tacticals, and customization options. We’ve only begun to scratch the surface as far as the content in the Beta goes, and Infinity Ward also has some surprises in store for you. So play as often as you can, and keep your eyes peeled. We’ll see you online!",
  "teaser": "",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Oct 18, 2016 12:24:28 PM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/2/1/IW_Beta.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "850",
  "author": "IW_Studio",
  "externalFlag": "false"
}, {
  "blog": "infinityward",
  "type": "message",
  "id": "10046631",
  "view_href": "/t5/Infinity-Ward-Blog/Call-of-Duty-Infinite-Warfare-Beta-Extended-on-PS4/ba-p/10046631",
  "subject": "Call of Duty: Infinite Warfare Beta Extended on PS4!",
  "body": "It’s day 3 of our Infinite Warfare MP Beta and we want to give a huge shout out and thanks to the amazing Call of Duty community. We saw massive numbers of people piling into the beta on day 2 and a lot of excitement when we added a new map, Precinct, and another mode, Kill Confirmed. We have some more surprises for you today, including Gun Game being added to the mix as well. I know what you’re thinking. That’s awesome, but the clock is already ticking and we only have 24 hours left to play. Well, don’t worry, we’ve got you covered. We’re extending the first weekend of the beta by 24 hours to give you more time to play and give us more time to stress test the system. With our Beta, we not only want to give you a sneak peek of what you’ll see in the final game, but we also want to put our servers and systems to the test so we’re ready for day 1. We’ve already collected a ton of data and gathered lots of insights to help us make your full multiplayer experience the best it can be ‪on November 4. We’re getting great feedback from you guys and we want to keep it coming. We’ve introduced a new matchmaking system into Infinite Warfare designed to provide the highest quality matches possible, and the Beta is our chance to stress test. We’ve been looking forward to the Beta because changes such as these require player data at scale in order to truly optimize the new system. So thanks again for your support of the Beta. If you have found yourself waiting a little longer than you are used to, we ask you to remain patient. We got you, just know that it’s all helping us optimize everything as we march toward launch. Just over the last two days, we’ve made numerous real-time modifications in-game that were only possible with your help. And please keep up the dialogue because it all goes toward helping us refine the online experience. Hit us up at on our beta feedback reporting forum. Infinite Warfare is a game we’re super proud of, and we’re looking forward to everyone playing as much as they can. -Infinity Ward",
  "teaser": "We’re happy to extend the PS4 Beta an extra 24 hours! ",
  "conversation": {
    "type": "conversation",
    "featured": false
  },
  "tags": [],
  "labels": [],
  "post_time": "Oct 18, 2016 11:54:04 AM",
  "images": "https://eikmo72643.i.lithium.com/eikmo72643/attachments/eikmo72643/infinityward/1/1/CoD_ExtendedBeta.jpg",
  "likes": "0",
  "author": "IW_Studio",
  "featured": "false",
  "views": "641",
  "author": "IW_Studio",
  "externalFlag": "false"
}]
